# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [5]:
baby_names = pd.read_csv('US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [6]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [7]:
baby_names.drop(columns=['Unnamed: 0', 'Id'], inplace=True)

### Step 6. Is there more male or female names in the dataset?

In [23]:
len(baby_names.groupby('Gender')['Name'].unique()[0]), len(baby_names.groupby('Gender')['Name'].unique()[1])

/var/folders/ls/_spv84gn29g3qtkdwrfjvbyc0000gp/T/ipykernel_17747/3092051994.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  len(baby_names.groupby('Gender')['Name'].unique()[0]), len(baby_names.groupby('Gender')['Name'].unique()[1])
/var/folders/ls/_spv84gn29g3qtkdwrfjvbyc0000gp/T/ipykernel_17747/3092051994.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  len(baby_names.groupby('Gender')['Name'].unique()[0]), len(baby_names.groupby('Gender')['Name'].unique()[1])

(10929, 8012)

### Step 7. Group the dataset by name and assign to names

In [25]:
names = baby_names.groupby('Name')

### Step 8. How many different names exist in the dataset?

In [26]:
len(names)

17632

### Step 9. What is the name with most occurrences?

In [32]:
names['Count'].sum().sort_values(ascending=False)

Name
Jacob         242874
Emma          214852
Michael       214405
Ethan         209277
Isabella      204798
               ...
Eniola             5
Atlantis           5
Marci              5
Simarpreet         5
Nita               5
Name: Count, Length: 17632, dtype: int64

### Step 10. How many different names have the least occurrences?

In [34]:
names['Count'].sum().sort_values()[names['Count'].sum().sort_values() == names['Count'].sum().sort_values().min()]

Name
Destenie       5
Janisha        5
Lizvet         5
Arsalan        5
Janira         5
              ..
Alyxandria     5
Ethanjoseph    5
Almira         5
Davarion       5
Xoey           5
Name: Count, Length: 2578, dtype: int64

### Step 11. What is the median name occurrence?

In [35]:
names['Count'].sum().sort_values().median()

np.float64(49.0)

### Step 12. What is the standard deviation of names?

In [36]:
names['Count'].sum().sort_values().std()

np.float64(11006.06946789057)

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [37]:
names['Count'].sum().describe()

count     17632.000000
mean       2008.932169
std       11006.069468
min           5.000000
25%          11.000000
50%          49.000000
75%         337.000000
max      242874.000000
Name: Count, dtype: float64